using UnityEditor;
using UnityEngine;

public class Editor_TZ 
{


    //начало:

    //ИНИТ = кнопка ЗАГРУЗИТЬ из фАЙЛА
    //загрузка нодов из файла в спец-класс
    // обновление области категорий данными из спец-класс
    // установка активной категории
    //   + заполненение области элементов для текущей выбранной категории (данными из спец-класс)
    // установка активным первого элемента

    //добавление / правка категории
    // открыть попап окно со всеми полями
    // ввод данных юзером (кроме поля - родителя)
    //  запись данных формы в спец-класс
    // обновление списка категорий
    // установка активной - только что добавленной + обновление области элементов

    //перемещение категории
    // попап окно с выбором категории куда перемещать (из дроп-списка)
    // обновление списка категорий с выбором текущей + элементов

    //удаление категории
    //  попап с вопросом подтверждения для удаления
    // обновление списка категорий + элементов

    //ренумерация категорий с шагом 10



    //добавление / правка элемента
    // открыть попап окно со всеми полями
    // ввод/измнение данных юзером (кроме поля - родителя)
    // запись данных формы в спец-класс
    // обновление списка элементов
    // установка активным добавленного/измененного

    //перемещение элемента
    // попап окно с выбором категории куда перемещать (из дроп-списка)
    // перенос + смена текущей категории на выбранную (обновление области категорий и элементов) и активации перенесенного элемента

    //удаление элемента
    //  попап с вопросом подтверждения для удаления
    // удаление и обновление списка элементов текущей категории


    //кнопка СОХРАНИТЬ в ФАЙЛ - запись данных в файл (возможно лучше сделать автозапись) с сохранением прошлой копии



    
}
